import sys
from pathlib import Path
# Путь на один уровень выше папки tests
sys.path.insert(0, str(Path(__file__).resolve().parent.parent))

from core.processor import CPU
from data.database import DatabaseManager

def run_script(script_lines):
    db = DatabaseManager()
    cpu = CPU(db_manager=db)

    for line in script_lines:
        line = line.strip()
        if not line or line.startswith("#"):
            continue  # комментарии и пустые строки пропускаем

        # Чтобы поддержать формат "1000 / 005350" с пробелами
        line = line.replace(" / ", "/").replace(" G ", "G").replace(" /", "/")

        output = cpu.execute(line)
        if output:
            print(output)

# Пример сценария из лекции
script = """


    1000/105121
    1002/0
    R1/2001
    2000/125
    1000G
    R1/
    2000/

    1000/005131
    1002/0
    R1/2000
    2000/3000
    3000/4
    1000G
    R1/
    2000/
    3000/

    1000/005240
    1002/0
    R0/2000
    1776/3
    1000G
    R0/
    1776/

    1000 / 005350
    1002 / 0
    R0 / 2002
    2000 / 3000
    3000 / 400
    1000 G
    R0 /
    1776 /
    3000 /

    1000/005261
    1002/20
    1004/0
    R1/1000
    1020/3
    1000G
    R1/
    1020/

    1000/105261
    1002/21
    1004/0
    R1/1000
    1020/3
    1000G
    1020/

    1000/105163
    1002/100
    1004/0
    R3/2000
    2100/1144
    1000G
    2100/

    1000/105273
    1002/100
    1004/0
    R3/400
    500/2000
    2000/7
    1000G
    2000/

    1000/105273
    1002/100
    1004/0
    R3/400
    500/2001
    2000/7
    1000G
    2000/407

    1000/005427
    1002/3
    1004/0
    1000G
    1002/

    1000/005337
    1002/2000
    1004/0
    2000/1
    1000G
    2000/

    1000/105137
    1002/2001
    1004/0
    2000/1
    1000G
    2000/

    1000/105337
    1002/2001
    1004/0
    2000/1401
    1000G
    2000/

    1000/005067
    1002/774
    1004/0
    2000/1
    1000G
    2000/

    1000/005167
    1002/1774
    1004/0
    3000/115
    1000G
    3000/

    1000/005167
    1002/1774
    1004/0
    3000/115
    1000G
    3000/

    1000/005077
    1002/774
    1004/0
    2000/3000
    3000/5
    1000G
    3000/


"""

if __name__ == "__main__":
    run_script(script.strip().splitlines())
